path = '''
            |     |          |     |      
            |     |          |     |
            |     |          |     |
            |     |          |     |
            |  1  |          |  2  |
            |     |          |     |
            |     |          |     |
            |     |          |     |
            |     |          |     |
            |     |          |     |
'''



path_2 = '''


                                      
            AAAA                        BBB
           AAAAAA                      BBBBB
          AAAAAAAA                    BBBBBBB
         AAAAAAAAAA                  BBBBBBBBB
        AAAAAAAAAAAA                BBBBBBBBBBB
       AAAAAAAAAAAAAA              BBBBBBBBBBBBBB
      AAAAAAAAAAAAAAAA            BBBBBBBBBBBBBBBB
     AAAAAAAAAAAAAAAAAA          BBBBBBBBBBBBBBBBBB
    AAAAAAAAAAAAAAAAAAAA        BBBBBBBBBBBBBBBBBBBB
   AAAAAAAAAAAAAAAAAAAAAA      BBBBBBBBBBBBBBBBBBBBBBB 




'''




path_3 = '''

            0000000000000     11111111111111     222222222222222
            0           0     1            1     2             2
            0           0     1            1     2             2
            0           0     1            1     2             2
            0         0 0     1          1 1     2          2  2
            0           0     1            1     2             2
            0           0     1            1     2             2
            0           0     1            1     2             2
            0           0     1            1     2             2
            0000000000000     11111111111111     222222222222222
            
            
'''
            
path_4 = '''

          =====================================================
          =                         11
          =
          =====================================================
          =                          10
          =
          =====================================================
          =                          9
          =
          =====================================================
          =                         8
          =
          =====================================================
          =                         7
          =
          =====================================================
          =                         6
          =
          =====================================================
          =                         5
          =
          =====================================================
          =                         4
          =
          =====================================================
          =                       3
          =
          =====================================================
          =                         2
          =
          =====================================================
          =                       1
          =
          =====================================================


'''



path_5 = '''


            00000000000000000010000000000000000000000000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000000000000000000100000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000000000001000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000001000000000000000000000000000000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000010000000000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000000000000000000000000
            00000000000000000000000000000000000000000000000000000
'''


escape = '''


            ㅌㅌㅌㅌㅌㅌㅌㅌㅌㅌㅌㅌ   ㅏ                                          ㅊ
            ㅌ                         ㅏ                            ㅊㅊㅊㅊㅊㅊㅊㅊㅊㅊㅊㅊㅊㅊ 
            ㅌ                         ㅏ                                         ㅊㅊ
            ㅌ                         ㅏ                                       ㅊ    ㅊ
            ㅌㅌㅌㅌㅌㅌㅌㅌㅌㅌㅌㅌ   ㅏㅏㅏㅏㅏㅏㅏㅏ                        ㅊ      ㅊ
            ㅌ                         ㅏ                                     ㅊ        ㅊ 
            ㅌ                         ㅏ                                    ㅊ          ㅊ
            ㅌ                         ㅏ                                   ㅊ            ㅊ
            ㅌ                         ㅏ                                  ㅊ               ㅊ
            ㅌㅌㅌㅌㅌㅌㅌㅌㅌㅌㅌㅌ   ㅏ                          ㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜㅜ
                                                                                    ㅜ
            ㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹ                                          ㅜ
                                        ㄹ                                          ㅜ
                                        ㄹ                                          ㅜ
                                        ㄹ                                          ㅜ
                                        ㄹ                                          ㅜ
                                        ㄹ                        ㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹ
            ㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹ                                                            ㄹ
            ㄹ                                                                                        ㄹ
            ㄹ                                                                                        ㄹ
            ㄹ                                                    ㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹ
            ㄹ                                                    ㄹ
            ㄹ                                                    ㄹ
            ㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹ                        ㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹ


'''








import random


print("당신은 미로에 갇혔습니다.")
print("빠져나가고 싶다면 5개의 문을 통과하여야 합니다.")
print("3번째 문에서는 지름길이 있으니 잘 선택하시길 바랍니다.")
print("지름길을 선택할 시 바로 5번째 문으로 이동합니다.")
print("####지름길을 못찾고 4번째 문으로 갈 시 통과할 확률이 매우 낮아집니다")
print(path)
right_path = random.randint(1,2)

choice = int(input("2개의 길이 있습니다. 어느 길로 가시겠습니까? "))

if choice == right_path:
    print("통과입니다!!")
    print("두 번째 문으로 이동합니다.")

    print(path_2)
    right_path = random.randint(1,2)
    choice = int(input("A와 B로 된 계단 중 어느 계단을 오르시겠습니까? [A계단 = 1번 B계단 = 2번] "))
    if choice == right_path:
        print("통과입니다!!")
        print("세 번째 문으로 이동합니다. 이번단계는 지름길이 있으니 잘 선택하시길 바랍니다.")

        print(path_3)
        right_path = random.randint(1,2)
        short_path = 0
        choice = int(input("0,1,2로 된 문이 3개가 있다. 이 중 한 개는 지름길이며 곧바로 5번째 문으로 갈 수 있다. 어느 문을 선택 하겠습니까? "))

        if choice == right_path:
            print("통과입니다!! but 지름길은 아닙니다 ^^")
            print("4번째 문으로 이동합니!!")

            print(path_4)
            right_path = random.randint(1,11)
            choice = int(input("11층으로 된 아파트가 보입니다. 어느 층으로 올라가야 5번째 문으로 갈 수 있을까요? "))
            if choice == right_path:
                print("드디어 마지막 단계에 이르렀습니다!")
                print("마지막 5번째 문으로 이동하겠습니다!")
                print("마지막 단계에서는 숨겨진 1이 모두 몇개인지 찾는 것입니다.")
                print("맞추시면 미로의 출구로 안내해 드립니다.")

                print(path_5)

                right_path = 5
                choice = int(input("숨겨진 1의 개수는 몇개입니까?  "))
                if choice == right_path:
                    print(escape)
                else:
                    print("마지막 단계인데 아쉽네요...")
            else:
                print("잘못된 길입니다..")
                
               
                    
            
        elif choice == short_path:
            print("지름길을 발견하셨네요!!")
            print("5번째 문으로 이동합니다!")

            print("마지막 단계에서는 숨겨진 1이 모두 몇개인지 찾는 것입니다.")
            print("맞추시면 미로의 출구로 안내해 드립니다!")

            print(path_5)
            right_path = 5
            choice = int(input("숨겨진 1의 개수는 몇개입니까? "))
            if choice == right_path:
                print(escape)
            else:
                print("마지막 단계인데 아쉽네요..")
                        

            
            
        else:
            print("아쉽네요..잘못된 길입니다..")
    else:
        print("3개의 문이나 더 남았는데 아쉽네요")
        
        
else:
    print("운이 안좋으시군요..")

































